import React, { Component } from 'react';
import PureRenderMixin from 'react-addons-pure-render-mixin'
import { withRouter,Link } from 'react-router-dom'

import './SiderBarCommentItem.less'
import './MSiderBarCommentItem.less'

class SiderBarCommentItem extends React.Component {

	constructor(props,context) {
		super(props,context)
		this.shouldComponentUpdate = PureRenderMixin.shouldComponentUpdate.bind(this)
	}

	componentDidMount() {
		
	}

	render() {
		return (
         	<div className="SiderBarCommentItem">
         		<div className="CommentTitle">	
                  <div>
                     <Link to="/user/3" className="avatar">
                        <img width="20" height="20" alt="" src="http://pcij2jrr4.bkt.clouddn.com/upload/tempcomavatar.jpg"/>
                     </Link>
                     <Link to="/user/3" className="nickname">用户123123jlasjdlkjkl12331231</Link>
            			<span className="tip">&nbsp;评论于&nbsp;</span>
         			</div>
                  <Link to="/article/2" className="articleName">阿斯达克前往荷兰和2贺卡上的客户了23就；23进来就爱上了大家及甲硫氨酸</Link>
         		</div>
         		<div className="CommentContent">
         			评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静安寺的23家里卡的及了就立刻卡刷卡2里就3艰苦拉萨角度考虑来3就就将3空间231及将3了就立刻及记录就及看将了就卡死了的空间23就2可就23离开将3看2及了
         		 评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静评论23加拉数据库好3距离喀什大家好3较快拉升阶段卡号为可了看了静v'v'v
               </div>
         	</div>
        )
	}
}

export default withRouter(SiderBarCommentItem)

